app/controllers/api/tasks_controller.rb

INSERT INTO "tasks" ("name", "description", "created_at", "updated_at", "notes") VALUES (?, ?, ?, ?, ?)  [["name", "Test Name"], ["description", "Test Desc"], ["created_at", "2018-02-23 13:25:13.177241"], ["updated_at", "2018-02-23 13:25:13.177241"], ["notes", "Test Notes"]]
---
  def create
    @task = Task.new(task_params)
    if @task.save

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]
---
  def destroy
    if @task.destroy