app/controllers/api/types_controller.rb

  def index
    @types = Type.all
---
SELECT "types".* FROM "types"

  def show
    @type = Type.find(params[:id])
---
SELECT  "types".* FROM "types" WHERE "types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]