app/controllers/types_controller.rb

SELECT "types".* FROM "types"
---
  def index
    @types = Type.all

SELECT  "types".* FROM "types" WHERE "types"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @type = Type.find(params[:id])